Revit 2024 API
FabricSheet.HostId Property
 The structure element that contains the Fabric Sheet.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public ElementId HostId { get; }
Visual Basic
Public ReadOnly Property HostId As ElementId
	Get
Visual C++
public:
property ElementId^ HostId {
	ElementId^ get ();
}
See Also
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace